## Task 4.9. Part 1.

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

In [2]:
### Setting path
path=r'C:\Users\User\Achievement4\Data'

In [3]:
# Importing "customers" dataframe
df_cust = pd.read_csv(os.path.join(path, 'Original Data', 'customers.csv'))

In [4]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
### Checking the dataframe shape
df_cust.shape

(206209, 10)

In [6]:
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [7]:
### Renaming columns
df_cust.rename(columns = {'First Name' : 'first_name'}, inplace = True)
df_cust.rename(columns = {'Surnam' : 'surname'}, inplace = True)
df_cust.rename(columns = {'Gender' : 'gender'}, inplace = True)
df_cust.rename(columns = {'STATE' : 'state'}, inplace = True)
df_cust.rename(columns = {'Age' : 'age'}, inplace = True)

In [8]:
df_cust.columns

Index(['user_id', 'first_name', 'surname', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

In [9]:
### Checking for missing values
df_cust.isnull().sum()

user_id             0
first_name      11259
surname             0
gender              0
state               0
age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

In [10]:
### Checking data types in our dataframe
df_cust.dtypes

user_id          int64
first_name      object
surname         object
gender          object
state           object
age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [11]:
### Checking for mixed types
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].map(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

first_name

In [12]:
### The column "first_name" contains mixed data types that needs to be fixed
df_cust['first_name'] = df_cust['first_name'].astype('str')

In [13]:
# The 'user_id' column, while not containing mixed data-types, is still improperly listed as an integer
df_cust['user_id'] = df_cust['user_id'].astype('str')

In [14]:
### Checking the data types after fixing 
df_cust.dtypes

user_id         object
first_name      object
surname         object
gender          object
state           object
age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [15]:
### checking for mixed data types again
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].map(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

In [16]:
### Now there is no mixed data

In [17]:
### Checking for missing data
df_cust.isnull().sum()

user_id         0
first_name      0
surname         0
gender          0
state           0
age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

In [18]:
# Check for full-duplicates
customers_dups = df_cust[df_cust.duplicated()]

In [19]:
customers_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

In [20]:
### There are no full-duplicates in the dataframe

In [21]:
### Checking descriptive statistics of the dataframe
df_cust.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

In [22]:
### I don't see any anomalies

## Combinig the "customers" data set with the Instacart data

In [23]:
### Importing the rest of the Instacart Data
ords_prods = pd.read_pickle(os.path.join(path, 'Prepared Data', 'orders_products_merged_grouped.pkl'))

In [24]:
### Checking columns of the Instacart dataframe
ords_prods.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,hour_of_day,...,reordered,_merge,price_range_loc,busiest_day,max_order,loyalty_flag,avg_price,spending_flag,median_days,frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,0,both,NaN,Regularly busy,32,Regular customer,6.935811,Low_spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,1,both,NaN,Regularly busy,32,Regular customer,6.935811,Low_spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,0,both,NaN,Busiest day,5,New customer,7.930208,Low_spender,8.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,0,both,NaN,Regularly busy,3,New customer,4.972414,Low_spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,1,both,NaN,Least busy,3,New customer,4.972414,Low_spender,9.0,Frequent customer

In [25]:
# Check the shape of the newly imported dataframe
ords_prods.shape

(32404859, 23)

In [26]:
# Check the shape of the customers dataframe
df_cust.shape

(206209, 10)

In [27]:
### Checking again the columns of ords_prods dataframe to find the shared column
ords_prods.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,hour_of_day,...,reordered,_merge,price_range_loc,busiest_day,max_order,loyalty_flag,avg_price,spending_flag,median_days,frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,0,both,NaN,Regularly busy,32,Regular customer,6.935811,Low_spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,1,both,NaN,Regularly busy,32,Regular customer,6.935811,Low_spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,0,both,NaN,Busiest day,5,New customer,7.930208,Low_spender,8.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,0,both,NaN,Regularly busy,3,New customer,4.972414,Low_spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,1,both,NaN,Least busy,3,New customer,4.972414,Low_spender,9.0,Frequent customer

In [28]:
### Both dataframes share the 'user_id' column
### Check data-type of shared column
ords_prods.dtypes['user_id']

dtype('int32')

In [29]:
df_cust.dtypes['user_id']

dtype('O')

In [30]:
# Make sure both key columns are the same data type
ords_prods['user_id'] = ords_prods['user_id'].astype('str')

In [31]:
### Deleting the "merge" colum
ords_prods = ords_prods.drop(columns=[ '_merge' ])

In [32]:
ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 22 columns):
 #   Column                  Dtype
---  ------                  -----
 0   product_id              int32
 1   product_name            object
 2   aisle_id                int32
 3   department_id           int32
 4   prices                  float64
 5   order_id                int32
 6   user_id                 object
 7   order_number            int32
 8   orders_day_of_week      int32
 9   hour_of_day             int32
 10  days_since_prior_order  float64
 11  first_order             bool
 12  add_to_cart_order       int32
 13  reordered               int8
 14  price_range_loc         object
 15  busiest_day             object
 16  max_order               int32
 17  loyalty_flag            object
 18  avg_price               float64
 19  spending_flag           object
 20  median_days             float64
 21  frequency_flag          object
dtypes: bool(1), float64(4), int32(9), int8(1), object(7)
memory usage: 3.8+ GB

In [33]:
### Changing data type of some columns to resolve memory issues
ords_prods[['prices', 'days_since_prior_order', 'avg_price', 'median_days']] = \
ords_prods[['prices', 'days_since_prior_order', 'avg_price', 'median_days']].astype('float32')

In [34]:
### Removing unnessesary columns to resolve memory issues
ords_prods = ords_prods.drop(columns=[ 'aisle_id', 'add_to_cart_order', 'price_range_loc' ])

In [35]:
ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 19 columns):
 #   Column                  Dtype
---  ------                  -----
 0   product_id              int32
 1   product_name            object
 2   department_id           int32
 3   prices                  float32
 4   order_id                int32
 5   user_id                 object
 6   order_number            int32
 7   orders_day_of_week      int32
 8   hour_of_day             int32
 9   days_since_prior_order  float32
 10  first_order             bool
 11  reordered               int8
 12  busiest_day             object
 13  max_order               int32
 14  loyalty_flag            object
 15  avg_price               float32
 16  spending_flag           object
 17  median_days             float32
 18  frequency_flag          object
dtypes: bool(1), float32(4), int32(7), int8(1), object(6)
memory usage: 2.8+ GB

In [ ]:
### Merging two dataframes using the column 'user_id' as the shared column with the inner join
custs_ords_prods = ords_prods.merge(df_cust, on = 'user_id', indicator = True)

In [ ]:
# Check inner join value counts
custs_ords_prods['_merge'].value_counts()

In [ ]:
### Exporting Dataframe 
custs_ords_prods.to_pickle(os.path.join(path, 'Prepared Data', 'orders_products_customers.pkl'))